import pandas as pd

print(
(lambda df:
f"Дані:\n{df}\n\n"
f"Товарів в категоріях:\n{df['Категорія'].value_counts()}\n\n"
f"Товарів по виробниках:\n{df['Виробник'].value_counts()}"
)(
pd.DataFrame({
"Назва товару": [
"Ноутбук Lenovo", "Смартфон Samsung", "Навушники Sony",
"Мікрохвильовка LG", "Пилосос Samsung", "Навушники Xiaomi",
"Телевізор LG", "Смартфон Xiaomi", "Смартфон Lenovo"
],
"Категорія": [
"Електроніка", "Електроніка", "Аксесуари",
"Техніка для дому", "Техніка для дому", "Аксесуари",
"Техніка для дому", "Електроніка", "Електроніка"
],
"Виробник": [
"Lenovo", "Samsung", "Sony", "LG",
"Samsung", "Xiaomi", "LG", "Xiaomi", "Lenovo"
],
"Ціна": [27000, 22000, 3500, 5000, 6200, 1500, 16000, 11000, 5999]
})
)
) 